<template>
    <div style="margin-left: -5px;width: 970px;height: 1000px;overflow: auto">
      <br>
      <h1>企业间票据撮合平台规则</h1>

      <br>

      <h4>第一章总则</h4>
      <br>
      <p>第一条 企业间票据撮合平台（https://www.zzti.com，以下简称“企业间票据撮合平台”、“企业间票据撮合”或“平台”）是由郑州市企业间票据撮合平台科技有限公司运营的电子票据信息撮合平台。为保障企业间票据撮合平台会员的合法权益，维护平台秩序，根据《中华人民共和国合同法》、《中华人民共和国票据法》、《互联网信息服务管理办法》《中国人民银行令[2016]第224号》等有关法律法规和政策，制定本规则。</p>
      <br>
      <p>第二条 本规则适用于会员（包括转让方、受让方、个人经纪商、企业经纪商）通过商票圈平台提供的技术服务完成票据撮合的行为。会员在使用本平台的服务时，应遵守国家法律、行政法规、部门规章等规范性文件，及遵守本规则，接受本平台的监督和管理。</p>
      <p></p>
      <br>
      <p>第三条 企业间票据撮合平台有权变更本规则或制定相关实施细则并在网站上予以公告。若会员对相关规则变更或实施细则有异议，应立即停止使用本平台的相关服务。相关规则及实施细则发布后会员仍继续使用本平台相关服务的，则视为接受企业间票据撮合平台的规则与实施细则。如会员对本规则内容有任何疑问，可向企业间票据撮合平台客服进行咨询。</p>
      <br>
      <p>第四条 请企业间票据撮合平台会员仔细阅读本规则并且严格按照本规则执行。</p>
      <br>

      <h4>第二章操作须知</h4>
      <br>
      <p>第五条 本规则规定的企业只有在企业间票据撮合平台上完成会员注册流程成为会员，才能使用平台提供的服务。</p>
      <br>
      <p>第六条 在企业间票据撮合平台为票据转让方或受让方提供服务前，各方须先行完成以下操作：

        1)根据平台规定在平台上进行注册，根据注册流程提交相关资料，注册成功后成为平台会员；

        2)平台会员须通过本平台提交开户申请，成功签约并创建会员银行二类账户（以下简称“二类账户”），会员二类账户创建成功后，会员需将其名下的实体银行账户与该二类账户进行绑定，此实体账户默认为平台会员背书账户和出金绑定账户，背书账户和出金账户在操作过程中可以更换，但必须是同名账户，同名出金；

        3)平台会员须通过本平台完成“e签宝”实名认证，并使用“e签宝”提供的电子签名、实名认证、时间戳、电子数据存证及出证服务，认可并接受会员使用“e签宝”过程中需遵守的行为规范、注意事项以及需要承担的法律责任（详见附件《e签宝风险提示函》）。平台会员应使用e签宝提供的服务进行平台线上合同或协议签署操作，视为各方理解并同意使用该数字证书签署本合同的行为具有完全的法律效力，各方将因此享有和承担合同约定的权利和义务。</p>
      <br>
      <p>第七条 企业间票据撮合平台会员同意委托华夏银行股份有限公司（或平台委托的其他第三方金融机构）作为平台会员资金的存管银行，认可并接受平台与第三方支付合作签署 的全部内容。</p>
      <br>
      <p>第八条 平台会员须根据平台规则向会员在存管银行开立的二类账户汇入票面金额一定比例的保证金，该笔保证金将在会员二类账户内冻结管理，并按照第三章“保证金规则”的要求执行。</p>
      <br>
      <p>第九条 企业间票据撮合平台运营时间为7*24小时。除出金行为受到人工审批时间限制，平台上的其他操作均可正常进行，平台的出金时间为工作日的9:00-16:30。平台会员需通过网上银行进行票据背书操作的时间限制以银行的规定为准。

      </p>
      <br>
      <p>第十条 平台遵从业内统一规则，将票据上出现过“回头、重复、保理、供应链、小贷、融资担保、投资、金融、租赁、质押、不可转让、上下不一致”等的情形列入瑕疵票情形（详见附件释义）。转让方应当在发布票据时，如实告知票据存在的瑕疵情况，受让方在受让票据时应当认真阅读转让方发布订单时已注明的瑕疵情形。</p>
      <br>

      <h4>第三章保证金规则</h4>
      <br>
      <p>第十一条 为保证企业间票据撮合平台会员双方的权益，平台将为转让方与受让方开设保证金账户专户，各方在发起转、受让操作之前，应当充值一定比例的金额作为保证金；该保证金将在各方自有的二类账户进行冻结保管，平台不接受任何一方的保管委托。各方同意按照本章节的规定执行保证金规则。</p>
      <br>
      <p>第十二条 保证金的冻结

        12.1平台会员无论作为转让方或者受让方，为保障双方在订单操作过程中不会被无故取消或延期操作等权益，双方在企业间票据撮合平台发布票据或受让票据时，需以票面金额为基数按照一定比例冻结保证金。目前保证金冻结比例为2‰（千分之二），冻结的保证金不少于人民币贰佰元，企业间票据撮合平台可对保证金的金额动态调整。

        12.2保证金账户资金分为可用保证金与冻结保证金两部分，可用保证金可随时充值或提现；保证金按照本规则进行冻结后划入冻结保证金账户，解冻后划拨至可用保证金内，如有违约责任，有可能会扣除冻结的保证金部分或全部金额。

        12.3转让方的保证金冻结规则：a)转让方向平台上传票面信息完成后，点击“一键融资”进入匹配中，系统自动冻结保证金；b)转让方在未匹配票据列表中，点击“一键融资”进入匹配中，系统自动冻结保证金。

        12.4受让方的保证金冻结规则：受让方对转让方提交的票面信息及报价确认无误，与转让方签署电子合同前，系统自动冻结保证金。</p>
      <br>
      <p>第十三条 保证金的冻结解除

        13.1条：转让方与受让方保证金的自动解除冻结

        出现以下任意一种情形时，系统将自动解除保证金的冻结，款项将实时返回到转让方或受让方的可用保证金账户内：

        1)转让方与受让方的转、受让行为已完成的；

        2)转让方与受让方任意一方申请解除，并经相对方同意后协商一致解除合同的；

        3)转让方与受让方任意一方申请解除，且无法与相对方协商一致，经平台判定符合解除条件的。

        13.2转让方的保证金自动解除冻结规则：转让方把处于“匹配中”的票据转为“暂停匹配”，转让方冻结的保证金实时解冻。

        13.3受让方的保证金自动解除冻结规则：受让方对订单签约确认后,转让方不接受报价等原因放弃订单, 此时受让方冻结的保证金实时解冻。</p>
      <br>
      <p>第十四条 冻结保证金的扣除规则

        14.1 超时扣除: 为保障双方效率，平台规定双方在转、受让操作   过程的各项程序中有时效限制，一方未在规定时限内完成约定操作，则按照已冻结保证金的10%进行扣除，扣除的保证金将全部赔付给守约一方；

        （例如：冻结1000元保证金，规定时间内未完成支付、背书、票据签收等操作，则扣除冻结比例10%，即：100元）

        14.2 强制取消的扣除: 出现以下情形，将强制扣除违约一方的保证金，扣除的保证金将全部赔付给守约一方：1）双方就取消订单不能达成一致，而申请方强制取消订单的，则扣除其在该订单上所交的剩余未被扣除的保证金；2）双方就取消订单不能达成一致且平台判定为不能取消后, 申请方强制取消订单的，则扣除其在该订单上所交的剩余未被扣除的保证金；

        14.3违约方自被扣除保证金之日起七日内，可向平台进行申诉，并按照平台要求提供相关联的书面证据。申诉成功的，保证金实时返还。</p>
      <br>
      <p>第十五条 违约保证金的提现

        违约方的保证金将实时转入守约方的账户余额（冻结状态），在违约方的申诉期届满且维持原决定后，自动解冻。解冻后的余额，守约方可随时提现。</p>
      <br>
      <p>第十六条 企业间票据撮合平台判定订单应该取消的原则，包括但不限于如下情况:转让方或受让方在操作过程中，出现不可归责于违约方的不可抗力因素：

        1)自然灾害、如台风、地震、洪水、冰雹；

        2)政府行为，如征收、征用；

        3)社会异常事件，如罢工、骚乱；

        4)因电力供应故障、通讯网络故障等公共服务因素；

        5)第三人因素等在合同订立时不能预见、不能避免并不能克服的客观情况。

      </p>
      <br>
      <p>第十七条 企业间票据撮合平台保留调整保证金定义、保证金比例设定及保证金金额计算方法的最终解释权。

      </p>
      <br>
      <p></p>
      <br>

      <h4>第四章平台操作总则</h4>
      <br>
      <p>第十八条 平台会员注册完成后，可根据业务实际需求，选择通过“我是票方”作为票据转让方进行操作；也可以选择通过“我是资方”作为票据受让方进行操作。</p>
      <br>
      <p>第十九条 票据转受让操作流程：

        19.1 票据转让方注册完成后，通过平台发布票据融资需求，并按照本规则第三章规定缴纳保证金后，点击“一键融资”进入匹配状态；。

        19.2 票据受让方注册完成后，通过平台设置票据偏好，设置完成后由系统根据偏好自动匹配符合票据偏好的持票转让方；

        19.3 系统匹配成功，实时通知票据受让方确认是否接受该笔订单。受让方在接受订单前，应保证账户内有足够的资金作为保证金。受让方经审查对转让方提交的票面信息及报价确认无误并选择接受的，按照系统的提示进行签约确认。受让方经审查选择不接受的，由系统另行匹配；

        19.4 受让方选择接受转让方订单的，应按照本规则第三章缴纳保证金。保证金冻结完成后，在线上完成相关合同的签署。合同签署完成系统自动通知转让方；

        19.5 转让方收到受让方确定订单通知后，对订单进行审查，认可受让方作为相对一方的，按照系统的提示进行确认后，在线上完成相关合同的签署。转让方不认可受让方作为相对一方的，可选择放弃，由系统另行匹配；

        19.6 双方对订单确认完成的，系统通知受让方支付对价。受让方将相应款项支付至受让方在存管银行华夏银行股份有限公司自行开设的银行二类账户，企业间票据撮合平台委托银行实时冻结资金。受让方应在系统要求时间内完成该笔订单对价的支付，超时支付的将按照保证金规则扣除一定比例的保证金。受让方不按照系统通知支付相应对价的，进入取消流程；

        19.7 受让方支付完成并到账后，系统通知转让方背书。转让方应在系统要求时间内将订单指定票据的收益权，以票据背书的方式转让于受让方名下。转让方应在系统要求时间内完成背书，超时完成的将按照保证金规则扣除一定比例的保证金。转让方不按照系统通知完成背书的，进入取消流程；

        19.8转让方通过网上银行完成背书流程后，通过系统通知受让方签收背书。受让方应在系统要求时间内完成签收背书，超时完成的将按照保证金规则扣除一定比例的保证金。受让方未收到票据签收提示的，可以在系统中提示转让方背书；受让方拒绝签收票据的，进入取消流程；

        19.9 受让方签收完成，系统向存管银行发送指令，由银行将支付对价转入转让方在存管银行自行开设的银行二类账户内。系统通知双方订单已完成，已冻结的保证金实时解冻；

        19.10 双方可通过已完成的订单对相对方进行评价。</p>
      <br>
      <p>第二十条 取消流程

        20.1 任意一方在订单匹配并确认完成后申请取消订单的，应向相对方提交取消的原因及证据；相对方同意取消订单的，订单结束；相对方不同意取消订单的，应提交拒绝的原因及证据；

        20.2 相对方拒绝取消订单申请的，申请一方可强制取消订单，但应按照本规则第三章向相对方赔付保证金；申请一方也可以在收到相对方的拒绝后，向平台进行申诉，由平台根据各方提交的书面材料及陈述进行判定；

        20.3 平台经审核后，认为符合取消理由的，订单取消，流程结束。认为不符合取消理由的，申请方可以选择继续履行，也可以强制取消订单，如强制取消的并按照本规则第三章向相对方赔付保证金；

        20.4订单进入“待签收”状态，任意一方均不可申请强制取消。</p>
      <br>
      <p>第二十一条 技术服务费

        21.1企业间票据撮合平台技有限公司为企业间票据撮合平台向会员提供的服务付出了大量的成本，会员同意并认可商票圈平台服务费收费标准的计算规则为：转让方实收金额（成交金额）=受让方实扣金额-技术服务费[成交金额*（基本费率±动态系数）]。商票圈平台为提高转让方与受让方之间的信息撮合效率，在系统中设置了基本费率，该费率标准会根据票据的票面金额、承兑主体信用、票据剩余天数以及市场供需等因素动态调整并自动生成；

        21.2具体转让金额、技术服务费等以单笔订单内容为准。</p>
      <br>
      <p>第二十二条 企业间票据撮合平台保留调整技术服务费定义及技术服务费金额计算方法的最终解释权。</p>
      <br>

      <h4>第五章经纪商总则</h4>
      <br>
      <p>第二十三条 企业间票据撮合平台设立经纪商制度，是为成功向平台推荐在平台完成注册的转让方或受让方在平台进行有效转、受让行为后，给予推荐一方奖励的一种制度。该推荐方为平台的经纪商会员，按本规则要求履行经纪行为并获取奖励。</p>
      <br>
      <p>第二十四条 成为经纪商会员需先行完成以下操作：

        24.1经纪商需在平台完成注册并在平台开通“钱包账号”；

        24.2经纪商通过平台生成的推荐链接或经纪商会员专属推荐码向平台推荐客户。</p>
      <br>
      <p>第二十五条 奖励规则

        25.1 由经纪商会员推荐的双方在平台完成的每一笔订单，平台均向经纪商会员计提奖励佣金。奖励标准为按照票面金额的一定比例进行计算；

        25.2 平台将依据订单中票据承兑人的信用评级、成交金额等因素对奖励佣金作出调整，并在订单详情中列明。</p>
      <br>
      <p>第二十六条 结算规则

        企业间票据撮合平台按照自然月度向经纪商结算奖励佣金，经纪商会员可以在“我的钱包”查看奖励明细。平台于次月10日内对上一个月度的奖励佣金进行结算，并划转至经纪商会员在平台开设的“钱包账户”内。经纪商会员可自行通过平台绑定一般银行账户对钱包内的资金进行提现。</p>
      <br>
      <p>第二十七条 个人经纪商根据本规则所获得的奖励佣金，按照国家法律法规应缴纳的税费由平台进行代扣代缴。企业经纪商根据本规则获得的奖励佣金，应向平台开具增值税专用发票。</p>
      <br>


      <h4>第六章 特别声明与保证</h4>
      <br>
      <p>第二十七条：企业间票据撮合平台会员双方声明与保证：

        27.1 其系依法合规成立并有效存续；

        27.2其系有权并已获充分和必要的授权在平台上发布信息及完成签署与转、受让行为相关的协议（及其他有关的任何文件）、履行在上述协议（及其他有关的任何文件）下的义务等动作，上述行为不违反任何适用于其的法律法规、公司章程与协议；

        27.3其符合票据及票据收益权转让相适应的转让条件及主体资格条件，已经取得签署和履行与票据及票据收益权转让相关协议所需的政府机关、监管机构的同意；

        27.4受让方保证并承诺通过企业间票据撮合平台进行转、受让的汇票和资金来源合法；

        27.5以其名义达成和签署协议的人员已获得充分和必要的授权，以其名义或代表其履行协议的人员已获得充分和必要的授权；

        27.6如实、准确、详细的披露，包括有利或不利于其转、受让票据及票据收益权的任何情形，且提供的与协议相关的一切文件均真实、有效、完整；

        27.7具备独立评估转、受让行为可能存在的风险的能力，能够对合同履行过程中所涉及的法律、财务、税务、会计和其他事项自行调查评估，且充分认识并愿意承担合同风险，根据自身的利益和判断履行权利义务；

        27.8其对根据协议约定需要向另一方支付的款项、交付的票据拥有完整的所有权或处置权，并且未设定任何形式的影响双方权利义务的情形。；</p>
      <br>
      <p>第二十八条 企业间票据撮合平台科技有限公司运营的企业间票据撮合平台，系为票据收益权转让需求方与受让需求方提供信息撮合的纯信息中介平台。企业间票据撮合平台平台声明如下：

        1)本平台为依法注册、合法经营的有限责任公司；

        2)本平台将严格保护平台会员的用户信息；

        3)本平台将公平公正处理会员间的纠纷；

        4)平台仅就会员双方达成合意提供信息撮合服务，仅根据会员双方的发出的指令完成受托事务。会员双方就转受让事宜在平台达成合意后，由会员双方另行通过中国人民银行开发的电子汇票系统（ECDS）进行票据背书转让，同时委托第三方持牌支付机构、第三方金融机构就合同履行项下的款项进行清算、结算与支付，平台不参与前款所述的任何行为。</p>
      <br>
      <p>第二十九条 企业间票据撮合平台保留对可疑订单、非法订单、高风险订单及相关纠纷进行独立判断和确定的权利。如遇司法机关要求，平台将依司法机关要求协查处理。平台将根据具体情况以电话、电子邮件、传真或其他形式通知到平台会员，并向平台会员提供有关司法机关的相关正式文件。</p>
      <br>
      <p>第三十条 企业间票据撮合平台服务网站https://www.zzti.com、微信公众号“企业间票据撮合平台”，为平台信息发布的指定途径。平台将通过网站或微信公众号向平台用户发布信息。</p>
      <br>
      <p>第三十一条 异常情况的处理

        31.1发生以下情况之一，导致部分或全部订单不能进行的，平台可决定技术性暂停，并予以公告：

        1)因地震、水灾、火灾等不可抗力的；

        2)因国家政策、法律法规调整的；

        3)平台会员出现结算、交收危机，对市场正在产生或者将产生重大影响的；

        4)技术故障及意外突发事件的；

        5)平台被非法侵入等；

        6)其它不可归责于平台的原因导致操作无法正常进行的；

        7)平台认定的其他情况。
        31.2企业间票据撮合平台不承担由于非自身系统问题、相关网络问题或自然灾害及其他不可抗力等上述31.1条所述的非本平台原因造成的相关损失和责任。如因不可抗力或其它本平台无法控制的原因使本平台系统崩溃或无法正常使用导致网上操作无法完成或丢失有关的信息、记录等，本平台会合理地尽力协助处理善后事宜。</p>
      <br>
      <p>第三十二条 如因系统升级、维护、故障恢复等需要暂时中止提供在线服务，平台将提前通知平台会员，并告知恢复日期。

      </p>
      <br>
      <p>第三十三条 风险提示：

        33.1企业间票据撮合平台会员了解本平台上的电票信息系会员自行发布，且可能存在风险和瑕疵，商票圈平台不能控制或保证平台会员发布的电票信息的真实性、合法性、准确性，亦不能控制或保证平台会员间在履行合同的过程中所涉及的服务的质量、安全及合法性、真实性和准确性；企业间票据撮合平台不能控制或保证平台会员具备能够履行合同项下所涉及的各项义务的能力，亦不能控制或保证平台各方能够按照各方约定内容履行各方各项义务。同时，转让会员请注意，其与以不具备受让资格的主受让方履行合同的风险是客观存在的；同时，受让会员应注意，其与以欺诈手段行事的人履行合同的风险是客观存在的。对此，各会员应谨慎判断；

        33.2尽管电子票据在企业间进行的转让已经比较普遍，但到目前为止，并没有相应的金融监管当局或法律法规，明文规定企业间非贸易背景项下的票据转让不存在任何问题。企业间票据撮合平台作为票据转受让的信息撮合方，只负责转让方与受让方就票据及票据收益权协议履行过程中所涉的票据或资金的安全，对于是否会因此引起其他法律风险，企业间票据撮合平台没有义务，也没有能力进行辨别、判断与规避。因此，特提醒请平台会员注意相关风险，遵守现行法律法规规定，谨慎处理。</p>
      <br>


      <h4>第七章 附则</h4>
      <br>
      <p>第三十四条 争端及纠纷的解决：

        1)因会员与本平台发生纠纷的，双方应友好协商解决，协商不成的，任何一方均有权向企业间票据撮合平台有限公司所在地人民法院提起诉讼。

        2)转让方与受让方之间的争端及纠纷均由双方友好协商解决，企业间票据撮合平台不予参与，但可以应双方邀请进行协调。</p>
      <br>
      <p>第三十五条 本规则为电子协议，平台会员在使用本网站过程中勾选“我已阅读并同意《企业间票据撮合平台信息撮合平台规则》”即表示生效。本规则《附件一》、《附件二》与本规则具同等效力。</p>
      <br>
      <p>第三十六条 企业间票据撮合平台科技有限公司在法律许可的范围内对本规则享有最终的解释权。</p>
      <br>



    </div>
</template>

<script>
    export default {
        name: "rule"
    }
</script>

<style scoped>
h1,h4{
  text-align: center;
}
</style>
