<template>
  <div style="width: 100%;height: 600px;" class="beijing">
  <div id="caiji">

    <div id="Register">   <el-form :model="userForm" ref="userForm" :rules="rules">
      <el-form-item prop="account">
        <el-input v-model="userForm.account" class="form-control" placeholder="请输入电话号码"></el-input>
      </el-form-item>

      <el-form-item prop="auth">
        <el-input v-model="userForm.auth" class="form-control" placeholder="请输入验证码" style="width: 55%;"></el-input>
        <el-button type="primary" style="width: 120px;margin-left: 7px;" @click="getting" >获取验证码</el-button>
      </el-form-item>
      <el-form-item prop="password">
        <el-input type="password" v-model="userForm.password" class="form-control" placeholder="请输入密码字母加数字"></el-input>
      </el-form-item>

      <el-form-item prop="checked">
        <el-checkbox v-model="checked" @change="dialogFormVisible = true;checked=false" ><span style="color: #f2f2f2">我已经遵守协议</span></el-checkbox>
      </el-form-item>

      <el-form-item>
        <el-button type="primary"  @click=" register('userForm')" style="width: 100%">注册</el-button>

      </el-form-item>
    </el-form></div>




  </div>

    <!--弹框-->
    <div class="repair">
      <el-dialog title="交易须知" :visible.sync="dialogFormVisible">
        <el-form :model="form" style="height: 400px;overflow: auto;text-align: center " >

          <h2>企业间票据撮合平台规则</h2>
          <br>
          <p>
              第一条（，以下简称“票据平台”、“票据撮合”或“平台”）是由中原工学院有限公司运营的电子票据信息撮合平台。为保障企业间票据撮合平台会员的合法权益，维护平台秩序，
              根据《中华人民共和国合同法》、《中华人民共和国票据法》、《互联网信息服务管理办法》.
          </p>

              第二条 本规则适用于会员（包括转让方、受让方、个人经纪商、企业经纪商）通过商票圈平台提供的技术服务完成票据撮合的行为。会员在使用本平台的服务时，应遵守国家法律、行政法规、部门规章等规范性文件，及遵守本规则，接受本平台的监督和管理。



              第三条  企业间票据撮合平台有权变更本规则或制定相关实施细则并在网站上予以公告。若会员对相关规则变更或实施细则有异议，应立即停止使用本平台的相关服务。相关规则及实施细则发布后会员仍继续使用本平台相关服务的，则视为接受商 企业间票据撮合平台的规则与实施细则。如会员对本规则内容有任何疑问，可向 企业间票据撮合平台客服进行咨询。



              第四条 请 企业间票据撮合平台会员仔细阅读本规则并且严格按照本规则执行。



              第二章 操作须知



              第五条 本规则规定的企业只有在商票圈平台上完成会员注册流程成为会员，才能使用平台提供的服务。



              第六条 在 企业间票据撮合平台为票据转让方或受让方提供服务前，各方须先行完成以下操作：

              1)根据平台规定在平台上进行注册，根据注册流程提交相关资料，注册成功后成为平台会员；

              2)平台会员须通过本平台提交开户申请，成功签约并创建会员银行二类账户（以下简称“二类账户”），会员二类账户创建成功后，会员需将其名下的实体银行账户与该二类账户进行绑定，此实体账户默认为平台会员背书账户和出金绑定账户，背书账户和出金账户在操作过程中可以更换，但必须是同名账户，同名出金；

              3)平台会员须通过本平台完成“e签宝”实名认证，并使用“e签宝”提供的电子签名、实名认证、时间戳、电子数据存证及出证服务，认可并接受会员使用“e签宝”过程中需遵守的行为规范、注意事项以及需要承担的法律责任（详见附件《e签宝风险提示函》）。平台会员应使用e签宝提供的服务进行平台线上合同或协议签署操作，视为各方理解并同意使用该数字证书签署本合同的行为具有完全的法律效力，各方将因此享有和承担合同约定的权利和义务。



              第七条  企业间票据撮合平台会员同意委托华夏银行股份有限公司（或平台委托的其他第三方金融机构）作为平台会员资金的存管银行，认可并接受平台与第三方支付合作签署 的全部内容。



              第八条 平台会员须根据平台规则向会员在存管银行开立的二类账户汇入票面金额一定比例的保证金，该笔保证金将在会员二类账户内冻结管理，并按照第三章“保证金规则”的要求执行。



              第九条  企业间票据撮合平台运营时间为7*24小时。除出金行为受到人工审批时间限制，平台上的其他操作均可正常进行，平台的出金时间为工作日的9:00-16:30。平台会员需通过网上银行进行票据背书操作的时间限制以银行的规定为准。



              第十条 平台遵从业内统一规则，将票据上出现过“回头、重复、保理、供应链、小贷、融资担保、投资、金融、租赁、质押、不可转让、上下不一致”等的情形列入瑕疵票情形（详见附件释义）。转让方应当在发布票据时，如实告知票据存在的瑕疵情况，受让方在受让票据时应当认真阅读转让方发布订单时已注明的瑕疵情形。



              第三章 保证金规则



              第十一条 为保证 企业间票据撮合平台会员双方的权益，平台将为转让方与受让方开设保证金账户专户，各方在发起转、受让操作之前，应当充值一定比例的金额作为保证金；该保证金将在各方自有的二类账户进行冻结保管，平台不接受任何一方的保管委托。各方同意按照本章节的规定执行保证金规则。



              第十二条 保证金的冻结

              12.1平台会员无论作为转让方或者受让方，为保障双方在订单操作过程中不会被无故取消或延期操作等权益，双方在商票圈发布票据或受让票据时，需以票面金额为基数按照一定比例冻结保证金。目前保证金冻结比例为2‰（千分之二），冻结的保证金不少于人民币贰佰元，商票圈平台可对保证金的金额动态调整。

              12.2保证金账户资金分为可用保证金与冻结保证金两部分，可用保证金可随时充值或提现；保证金按照本规则进行冻结后划入冻结保证金账户，解冻后划拨至可用保证金内，如有违约责任，有可能会扣除冻结的保证金部分或全部金额。

              12.3转让方的保证金冻结规则：a)转让方向平台上传票面信息完成后，点击“一键融资”进入匹配中，系统自动冻结保证金；b)转让方在未匹配票据列表中，点击“一键融资”进入匹配中，系统自动冻结保证金。

              12.4受让方的保证金冻结规则：受让方对转让方提交的票面信息及报价确认无误，与转让方签署电子合同前，系统自动冻结保证金。



              第十三条 保证金的冻结解除

              13.1条：转让方与受让方保证金的自动解除冻结

              出现以下任意一种情形时，系统将自动解除保证金的冻结，款项将实时返回到转让方或受让方的可用保证金账户内：

              1)转让方与受让方的转、受让行为已完成的；

              2)转让方与受让方任意一方申请解除，并经相对方同意后协商一致解除合同的；

              3)转让方与受让方任意一方申请解除，且无法与相对方协商一致，经平台判定符合解除条件的。

              13.2转让方的保证金自动解除冻结规则：转让方把处于“匹配中”的票据转为“暂停匹配”，转让方冻结的保证金实时解冻。

              13.3受让方的保证金自动解除冻结规则：受让方对订单签约确认后,转让方不接受报价等原因放弃订单, 此时受让方冻结的保证金实时解冻。



              第十四条 冻结保证金的扣除规则

              14.1 超时扣除: 为保障双方效率，平台规定双方在转、受让操作   过程的各项程序中有时效限制，一方未在规定时限内完成约定操作，则按照已冻结保证金的10%进行扣除，扣除的保证金将全部赔付给守约一方；

              （例如：冻结1000元保证金，规定时间内未完成支付、背书、票据签收等操作，则扣除冻结比例10%，即：100元）

              14.2 强制取消的扣除: 出现以下情形，将强制扣除违约一方的保证金，扣除的保证金将全部赔付给守约一方：1）双方就取消订单不能达成一致，而申请方强制取消订单的，则扣除其在该订单上所交的剩余未被扣除的保证金；2）双方就取消订单不能达成一致且平台判定为不能取消后, 申请方强制取消订单的，则扣除其在该订单上所交的剩余未被扣除的保证金；

              14.3违约方自被扣除保证金之日起七日内，可向平台进行申诉，并按照平台要求提供相关联的书面证据。申诉成功的，保证金实时返还。



              第十五条 违约保证金的提现

              违约方的保证金将实时转入守约方的账户余额（冻结状态），在违约方的申诉期届满且维持原决定后，自动解冻。解冻后的余额，守约方可随时提现。



              第十六条  企业间票据撮合平台判定订单应该取消的原则，包括但不限于如下情况:转让方或受让方在操作过程中，出现不可归责于违约方的不可抗力因素：

              1)自然灾害、如台风、地震、洪水、冰雹；

              2)政府行为，如征收、征用；

              3)社会异常事件，如罢工、骚乱；

              4)因电力供应故障、通讯网络故障等公共服务因素；

              5)第三人因素等在合同订立时不能预见、不能避免并不能克服的客观情况。



              第十七条  企业间票据撮合平台保留调整保证金定义、保证金比例设定及保证金金额计算方法的最终解释权。



              第四章 平台操作规则



              第十八条 平台会员注册完成后，可根据业务实际需求，选择通过“我是票方”作为票据转让方进行操作；也可以选择通过“我是资方”作为票据受让方进行操作。



              第十九条 票据转受让操作流程：

              19.1 票据转让方注册完成后，通过平台发布票据融资需求，并按照本规则第三章规定缴纳保证金后，点击“一键融资”进入匹配状态；。

              19.2 票据受让方注册完成后，通过平台设置票据偏好，设置完成后由系统根据偏好自动匹配符合票据偏好的持票转让方；

              19.3 系统匹配成功，实时通知票据受让方确认是否接受该笔订单。受让方在接受订单前，应保证账户内有足够的资金作为保证金。受让方经审查对转让方提交的票面信息及报价确认无误并选择接受的，按照系统的提示进行签约确认。受让方经审查选择不接受的，由系统另行匹配；

              19.4 受让方选择接受转让方订单的，应按照本规则第三章缴纳保证金。保证金冻结完成后，在线上完成相关合同的签署。合同签署完成系统自动通知转让方；

              19.5 转让方收到受让方确定订单通知后，对订单进行审查，认可受让方作为相对一方的，按照系统的提示进行确认后，在线上完成相关合同的签署。转让方不认可受让方作为相对一方的，可选择放弃，由系统另行匹配；

              19.6 双方对订单确认完成的，系统通知受让方支付对价。受让方将相应款项支付至受让方在存管银行华夏银行股份有限公司自行开设的银行二类账户，商票圈平台委托银行实时冻结资金。受让方应在系统要求时间内完成该笔订单对价的支付，超时支付的将按照保证金规则扣除一定比例的保证金。受让方不按照系统通知支付相应对价的，进入取消流程；

              19.7 受让方支付完成并到账后，系统通知转让方背书。转让方应在系统要求时间内将订单指定票据的收益权，以票据背书的方式转让于受让方名下。转让方应在系统要求时间内完成背书，超时完成的将按照保证金规则扣除一定比例的保证金。转让方不按照系统通知完成背书的，进入取消流程；

              19.8转让方通过网上银行完成背书流程后，通过系统通知受让方签收背书。受让方应在系统要求时间内完成签收背书，超时完成的将按照保证金规则扣除一定比例的保证金。受让方未收到票据签收提示的，可以在系统中提示转让方背书；受让方拒绝签收票据的，进入取消流程；

              19.9 受让方签收完成，系统向存管银行发送指令，由银行将支付对价转入转让方在存管银行自行开设的银行二类账户内。系统通知双方订单已完成，已冻结的保证金实时解冻；

              19.10 双方可通过已完成的订单对相对方进行评价。



              第二十条 取消流程

              20.1 任意一方在订单匹配并确认完成后申请取消订单的，应向相对方提交取消的原因及证据；相对方同意取消订单的，订单结束；相对方不同意取消订单的，应提交拒绝的原因及证据；

              20.2 相对方拒绝取消订单申请的，申请一方可强制取消订单，但应按照本规则第三章向相对方赔付保证金；申请一方也可以在收到相对方的拒绝后，向平台进行申诉，由平台根据各方提交的书面材料及陈述进行判定；

              20.3 平台经审核后，认为符合取消理由的，订单取消，流程结束。认为不符合取消理由的，申请方可以选择继续履行，也可以强制取消订单，如强制取消的并按照本规则第三章向相对方赔付保证金；

              20.4订单进入“待签收”状态，任意一方均不可申请强制取消。



              第二十一条 技术服务费

              21.1 企业间票据撮合平台向会员提供的服务付出了大量的成本，会员同意并认可 企业间票据撮合平台服务费收费标准的计算规则为：转让方实收金额（成交金额）=受让方实扣金额-技术服务费[成交金额*（基本费率±动态系数）]。商票圈平台为提高转让方与受让方之间的信息撮合效率，在系统中设置了基本费率，该费率标准会根据票据的票面金额、承兑主体信用、票据剩余天数以及市场供需等因素动态调整并自动生成；

              21.2具体转让金额、技术服务费等以单笔订单内容为准。



              第二十二条  企业间票据撮合平台保留调整技术服务费定义及技术服务费金额计算方法的最终解释权。







              第五章 经纪商规则



              第二十三条 企业间票据撮合平台设立经纪商制度，是为成功向平台推荐在平台完成注册的转让方或受让方在平台进行有效转、受让行为后，给予推荐一方奖励的一种制度。该推荐方为平台的经纪商会员，按本规则要求履行经纪行为并获取奖励。



              第二十四条 平台经纪商分为个人经纪商和企业经纪商。



              第二十四条 成为经纪商会员需先行完成以下操作：

              24.1经纪商需在平台完成注册并在平台开通“钱包账号”；

              24.2经纪商通过平台生成的推荐链接或经纪商会员专属推荐码向平台推荐客户。



              第二十五条 奖励规则

              25.1 由经纪商会员推荐的双方在平台完成的每一笔订单，平台均向经纪商会员计提奖励佣金。奖励标准为按照票面金额的一定比例进行计算；

              25.2 平台将依据订单中票据承兑人的信用评级、成交金额等因素对奖励佣金作出调整，并在订单详情中列明。



              第二十六条 结算规则

          企业间票据撮合平台按照自然月度向经纪商结算奖励佣金，经纪商会员可以在“我的钱包”查看奖励明细。平台于次月10日内对上一个月度的奖励佣金进行结算，并划转至经纪商会员在平台开设的“钱包账户”内。经纪商会员可自行通过平台绑定一般银行账户对钱包内的资金进行提现。



              第二十七条 个人经纪商根据本规则所获得的奖励佣金，按照国家法律法规应缴纳的税费由平台进行代扣代缴。企业经纪商根据本规则获得的奖励佣金，应向平台开具增值税专用发票。



              第六章 特别声明与保证



              第二十七条： 企业间票据撮合平台会员双方声明与保证：

              27.1 其系依法合规成立并有效存续；

              27.2其系有权并已获充分和必要的授权在平台上发布信息及完成签署与转、受让行为相关的协议（及其他有关的任何文件）、履行在上述协议（及其他有关的任何文件）下的义务等动作，上述行为不违反任何适用于其的法律法规、公司章程与协议；

              27.3其符合票据及票据收益权转让相适应的转让条件及主体资格条件，已经取得签署和履行与票据及票据收益权转让相关协议所需的政府机关、监管机构的同意；

              27.4受让方保证并承诺通过商票圈平台进行转、受让的汇票和资金来源合法；

              27.5以其名义达成和签署协议的人员已获得充分和必要的授权，以其名义或代表其履行协议的人员已获得充分和必要的授权；

              27.6如实、准确、详细的披露，包括有利或不利于其转、受让票据及票据收益权的任何情形，且提供的与协议相关的一切文件均真实、有效、完整；

              27.7具备独立评估转、受让行为可能存在的风险的能力，能够对合同履行过程中所涉及的法律、财务、税务、会计和其他事项自行调查评估，且充分认识并愿意承担合同风险，根据自身的利益和判断履行权利义务；

              27.8其对根据协议约定需要向另一方支付的款项、交付的票据拥有完整的所有权或处置权，并且未设定任何形式的影响双方权利义务的情形。；



              第二十八条  企业间票据撮合平台科技有限公司运营的 企业间票据撮合平台，系为票据收益权转让需求方与受让需求方提供信息撮合的纯信息中介平台。 企业间票据撮合平台声明如下：

              1)本平台为依法注册、合法经营的有限责任公司；

              2)本平台将严格保护平台会员的用户信息；

              3)本平台将公平公正处理会员间的纠纷；

              4)平台仅就会员双方达成合意提供信息撮合服务，仅根据会员双方的发出的指令完成受托事务。会员双方就转受让事宜在平台达成合意后，由会员双方另行通过中国人民银行开发的电子汇票系统（ECDS）进行票据背书转让，同时委托第三方持牌支付机构、第三方金融机构就合同履行项下的款项进行清算、结算与支付，平台不参与前款所述的任何行为。



              第二十九条  企业间票据撮合平台保留对可疑订单、非法订单、高风险订单及相关纠纷进行独立判断和确定的权利。如遇司法机关要求，平台将依司法机关要求协查处理。平台将根据具体情况以电话、电子邮件、传真或其他形式通知到平台会员，并向平台会员提供有关司法机关的相关正式文件。



              第三十条  企业间票据撮合平台服务网站https://www.shangpiaoquan.com、微信公众号“商票圈”，为平台信息发布的指定途径。平台将通过网站或微信公众号向平台用户发布信息。



              第三十一条 异常情况的处理

              31.1发生以下情况之一，导致部分或全部订单不能进行的，平台可决定技术性暂停，并予以公告：

              1)因地震、水灾、火灾等不可抗力的；

              2)因国家政策、法律法规调整的；

              3)平台会员出现结算、交收危机，对市场正在产生或者将产生重大影响的；

              4)技术故障及意外突发事件的；

              5)平台被非法侵入等；

              6)其它不可归责于平台的原因导致操作无法正常进行的；

              7)平台认定的其他情况。
              31.2 企业间票据撮合平台不承担由于非自身系统问题、相关网络问题或自然灾害及其他不可抗力等上述31.1条所述的非本平台原因造成的相关损失和责任。如因不可抗力或其它本平台无法控制的原因使本平台系统崩溃或无法正常使用导致网上操作无法完成或丢失有关的信息、记录等，本平台会合理地尽力协助处理善后事宜。



              第三十二条 如因系统升级、维护、故障恢复等需要暂时中止提供在线服务，平台将提前通知平台会员，并告知恢复日期。



              第三十三条 风险提示：

              33.1 企业间票据撮合平台会员了解本平台上的电票信息系会员自行发布，且可能存在风险和瑕疵， 企业间票据撮合平台不能控制或保证平台会员发布的电票信息的真实性、合法性、准确性，亦不能控制或保证平台会员间在履行合同的过程中所涉及的服务的质量、安全及合法性、真实性和准确性；商票圈平台不能控制或保证平台会员具备能够履行合同项下所涉及的各项义务的能力，亦不能控制或保证平台各方能够按照各方约定内容履行各方各项义务。同时，转让会员请注意，其与以不具备受让资格的主受让方履行合同的风险是客观存在的；同时，受让会员应注意，其与以欺诈手段行事的人履行合同的风险是客观存在的。对此，各会员应谨慎判断；

              33.2尽管电子票据在企业间进行的转让已经比较普遍，但到目前为止，并没有相应的金融监管当局或法律法规，明文规定企业间非贸易背景项下的票据转让不存在任何问题。 企业间票据撮合平台作为票据转受让的信息撮合方，只负责转让方与受让方就票据及票据收益权协议履行过程中所涉的票据或资金的安全，对于是否会因此引起其他法律风险，商票圈平台没有义务，也没有能力进行辨别、判断与规避。因此，特提醒请平台会员注意相关风险，遵守现行法律法规规定，谨慎处理。



              第七章 附则



              第三十四条 争端及纠纷的解决：

              1)因会员与本平台发生纠纷的，双方应友好协商解决，协商不成的，任何一方均有权向 企业间票据撮合平台限公司所在地人民法院提起诉讼。

              2)转让方与受让方之间的争端及纠纷均由双方友好协商解决， 企业间票据撮合平台平台不予参与，但可以应双方邀请进行协调。



              第三十五条 本规则为电子协议，平台会员在使用本网站过程中勾选“我已阅读并同意《 企业间票据撮合平台撮合平台规则》”即表示生效。本规则《附件一》、《附件二》与本规则具同等效力。



              第三十六条  企业间票据撮合平台有限公司在法律许可的范围内对本规则享有最终的解释权。
          一: 信用组成和权重

          违约率(权重80%),

          放弃率(权重2%),

          差评率(权重5%),

          平均操作时间(权重10%),

          假票率(权重5%)



          二: 信用组成计算公式



          违约率 = 违约订单总数 / 订单总数

          放弃率 = 放弃订单总数 / 订单总数

          差评率 = 差评订单总数 / 评价订单总数

          假票率 = 假票总数  /  发布票据总数

          平均操作时间 = 累计操作时间 / 累计操作次数



          三: 信用分公式



          信用分 = 100 - (违约率 * 100 * 80%) - (平均操作时间/3600 * 100 * 10%)  - (差评率 * 100 * 5%)

          - (假票率 * 100 * 5%) - (放弃率 * 100 * 2%)

          如:

          违约率 = 5%, 平均操作时间 = 1200秒,  差评率 = 10%, 假票率=5%, 放弃率 = 20%

          信用分 = 100 - (5% * 100 * 80%)  - (1200/3600 * 100 * 10%) - (10% * 100 * 5%)

          - (5% * 100 * 5% ) - (20% * 100 * 2%)



          四: 信用划分



          信用分 >=  90               优秀

          80 <= 信用分 < 90        良好

          70 <= 信用分 < 80        一般

          信用分 < 70                   较低

          ·提示条款



          欢迎签署《平台服务协议》（下称“本协议”）并使用商票圈平台服务！



          企业间票据撮合平台有限公司(以下简称“公司”或“本公司”)通过合法运营的“商票圈”平台（网址：https://www.shangpiaoquan.com，以下简称“商票圈”或“平台”）为平台注册用户（以下简称“会员”、“会员单位”）提供电子票据信息撮合服务。



          服务条款前所列索引关键词仅为帮助会员理解该条款表达的主旨之用，不影响或限制本协议条款的含义或解释。为维护会员自身权益，建议会员仔细阅读各条款具体表述。



          【审慎阅读】

          会员在申请注册流程中点击同意本协议之前，应当认真阅读本协议。

          请会员务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款、法律适用和争议解决条款。免除或者限制责任的条款将以粗体下划线标识，会员应重点阅读。如会员对协议有任何疑问，可向商票圈平台客服咨询。



          【签约动作】

          当会员按照注册页面提示填写信息、阅读并同意本协议且完成全部注册程序后，即表示会员已充分阅读、理解并接受本协议的全部内容，并与商票圈达成一致，成为商票圈平台“用户”。阅读本协议的过程中，如果会员不同意本协议或其中任何条款约定，会员应立即停止注册程序。



          一、 定义



          企业间票据撮合平台平台：企业间票据撮合平台微信公众号；



          企业间票据撮合平台：指由深圳市商票圈科技有限公司开发的票据信息撮合服务平台，旨在为票据收益权转让方与受让方建立票据信息发布、撮合的安全通道设立的信息撮合中介平台；



          企业间票据撮合平台平台规则：包括在商票圈平台已经发布及后续发布的全部规则、解读、实施细则、产品流程说明、公告等；



          会员：包括以转让方、受让方、经纪商等形式在商票圈平台进行相关活动的自然人、法人及其他组织。



          关联公司：企业间票据撮合平台；



          同一用户：使用同一身份认证信息或经商票圈排查认定多个企业间票据撮合平台账户的实际控制人为同一人的，均视为同一用户。



          二、 协议范围



          2.1 签约主体



          【平等主体】

          本协议由通过企业间票据撮合平台平台进行撮合的转让方、受让方共同缔结，及由其他身份参加到本平台，根据本平台规则开展相关活动的成员，本协议对各方均具有合同效力。



          除协议文义特指的与转让方、受让方就票据及票据收益权转受让行为相关的规范，本协议适用于所有会员成员。



          2.2补充协议



          由于互联网高速发展，会员与商票圈签署的本协议列明的条款并不能完整罗列并覆盖会员与商票圈所有权利与义务，现有的约定也不能保证完全符合未来发展的需求。因此，商票圈平台法律声明及隐私权政策、商票圈平台规则均为本协议的补充协议，与本协议不可分割且具有同等法律效力。如会员使用商票圈平台服务，视为会员同意上述补充协议。



          三、 账户注册与使用



          3.1 用户资格



          参与企业间票据撮合平台平台撮合业务的会员为企业会员，是指通过平台完成全部注册程序后，使用平台服务，并且依据中华人民共和国法律规定的在境内（不含香港、澳门特别行政区和台湾地区）设立的具有完全民事权利和民事行为能力，能够独立承担民事责任的法人和其他组织。



          会员确认，在会员开始注册使用商票圈平台服务时，会员应当具备符合中华人民共和国法律法规规定中，关于票据及票据收益权转让相适应的转让条件及主体资格条件。若会员不具备前述与会员行为相适应的转让条件及主体资格条件，则会员应依照法律规定承担因此而导致的一切后果。



          3.2 账户说明



          【账户获得】

          当会员按照注册页面提示填写主体资料等信息、阅读并同意本协议且完成全部注册程序后，会员可获得商票圈平台账户并成为商票圈平台用户。

          商票圈平台只允许每位用户使用一个商票圈平台账户。如有证据证明或商票圈根据商票圈平台规则判断会员存在不当注册或不当使用多个商票圈平台账户的情形，商票圈平台可采取冻结或关闭账户、取消订单、拒绝提供服务等措施，如给商票圈平台及相关方造成损失的，会员还应承担赔偿责任。



          【账户使用】

          会员有权使用会员设置或确认的商票圈会员名（手机号码，以下简称“账户名称”）及会员设置的密码（账户名称及密码合称“账户”）登录商票圈平台。

          由于会员的商票圈账户关联会员的企业信息及商票圈平台商业信息，会员的商票圈账户仅限会员使用。未经商票圈平台同意，会员直接或间接授权第三方使用会员商票圈账户或获取会员账户项下信息的行为无效。如商票圈根据商票圈平台规则中约定的违约认定程序及标准判断会员商票圈账户的使用可能危及会员的账户安全及/或商票圈平台信息安全的，商票圈平台可拒绝提供相应服务或终止本协议。



          【账户转让】

          会员的账户不得以任何方式转让，否则商票圈平台有权追究会员的违约责任，且由此产生的一切责任均由会员承担。



          【实名认证】

          作为企业间票据撮合平台平台经营者，为使会员更好地使用商票圈平台的各项服务，保障会员的账户安全，会员应按照商票圈要求及我国法律规定完成实名认证，否则账户无法正常使用。



          【不活跃账户回收】

          如会员的账户同时符合以下条件，则商票圈可回收会员的账户，会员的账户将不能再登录平台，相应服务同时终止：

          （一）未绑定通过实名认证的账户；

          （二）连续六个月未登录平台；

          （三）不存在未到期的有效业务。



          3.3 注册信息管理



          3.3.1 真实合法



          【信息真实】

          在使用企业间票据撮合平台平台服务前，会员应当按商票圈平台页面的提示，完成企业会员认证，准确完整地提供会员的各项工商信息（包括会员的企业全称、统一社会信用代码、企业实际经营地址、联系电话，联系邮箱）、法定代表人信息（包括姓名、身份证号、手机号），以及会员授权的企业经办人信息（包括姓名，手机号）以便商票圈或其他用户与会员联系。

          在通过企业间票据撮合平台平台进行首次操作前，会员应当按商票圈平台页面的提示，提供并上传会员的营业执照、机构信用代码证扫描件、法定代表人身份证正反面扫描件。并于每次申请前，提供并上传与转、受让标的票据相关的发票合同等文件。

          会员了解并同意，会员有义务保持会员提供以上信息的真实性及有效性。



          3.3.2 更新维护



          会员应当及时更新会员提供的信息，在法律有明确规定要求商票圈作为平台服务提供者必须对部分用户的信息进行核实的情况下，商票圈将依法不时地对会员的信息进行检查核实，会员应当配合提供最新、真实、完整、有效的信息。

          如企业间票据撮合平台按会员最后一次提供的信息与会员联系未果、会员未按商票圈的要求及时提供信息、会员提供的信息存在明显不实或行政司法机关核实会员提供的信息无效的，会员将承担因此对会员自身、他人及商票圈造成的全部损失与不利后果。商票圈可向会员发出询问或要求整改的通知，并要求会员进行重新认证，直至中止、终止对会员提供部分或全部商票圈平台服务，商票圈对此不承担责任。



          3.4 账户安全规范



          【账户安全保管义务】

          会员的账户为会员自行设置并由会员保管，商票圈任何时候均不会主动要求会员提供会员的账户密码。因此，建议会员务必保管好会员的账户，并确保会员在每个上网时段结束时退出登录并以正确步骤离开商票圈平台。

          账户因会员主动泄露或因会员遭受他人攻击、诈骗等行为导致的损失及后果，商票圈并不承担责任，会员应通过司法、行政等救济途径向侵权行为人追偿。



          【账户行为责任自负】

          除企业间票据撮合平台存在过错外，会员应对会员账户项下的所有行为结果（包括但不限于在线签署各类协议、发布信息、转让或受让票据及票据收益权及披露信息等）负责。



          【日常维护须知】

          如发现任何未经授权使用会员账户登录商票圈平台或其他可能导致会员账户遭窃、遗失的情况，建议会员立即通知商票圈。

          会员理解企业间票据撮合平台对会员的任何请求采取行动均需要合理时间，且商票圈应会员请求而采取的行动可能无法避免或阻止侵害后果的形成或扩大，除企业间票据撮合平台存在法定过错外，企业间票据撮合平台不承担责任。



          四、 企业间票据撮合平台平台服务及规范



          4.1平台服务概况



          【服务概况】

          会员有权在企业间票据撮合平台上以“转让方”或“受让方”的身份，根据实际业务需要发布转让需求或受让需求，并按照商票圈平台提示的操作流程、行为要素以及订单凭证完成操作，遵守商票圈信息撮合平台规则。

          企业间票据撮合平台仅为会员用户提供票据信息撮合服务，不对会员作为“转让方”或是“受让方”任意方发布的任何需求做实质性审查。因会员双方的行为违反现行有效法律法规规定所造成的损失，由双方自行协商并自行承担。因会员双方的上述行为给商票圈平台造成损失，按照本协议第六条处理。



          【秩序保障】

          会员应当遵守诚实信用原则，确保会员所发布的需求与实际相符，并在合同履行过程中切实履行会员的承诺。会员应当维护企业间票据撮合平台市场良性竞争秩序，不得干扰商票圈平台上进行的任何行为、活动，不得以任何方式干扰或试图干扰企业间票据撮合平台的正常运作。



          4.2平台会员承诺



          【会员承诺】

          会员保证并承诺通过企业间票据撮合平台平台进行转、受让的汇票和资金来源合法；会员保证并承诺其通过企业间票据撮合平台平台发布的信息均真实有效，其向平台提交的任何资料均真实、有效、完整、准确；会员不得私自仿制、伪造在网站上签订的电子合同或印章，不得用伪造的合同进行任何欺诈行为或进行其他非法使用任。



          4.3争议处理



          【争议处理途径】

          会员在企业间票据撮合平台平台操作过程中与其他用户发生争议的，会员或其他用户中任何一方均有权选择以下途径解决：

          （一）与争议相对方自主协商；

          （二）其他依法成立的调解组织调解；

          （三）向有关行政部门投诉；

          （四）根据与争议相对方达成的仲裁协议（如有）提请仲裁机构仲裁；

          （五）向人民法院提起诉讼。



          4.4费用



          企业间票据撮合平台为企业间票据撮合平台平台向会员提供的服务付出了大量的成本，会员同意并认可企业间票据撮合平台平台服务费收费标准的计算规则为：转让方实收金额（成交金额）=受让方实扣金额-服务费（成交金额*基本费率±动态系数）。商票圈平台为提高转让方与受让方之间的信息撮合效率，在系统中设置了基本费率，该费率标准会根据票据的票面金额、承兑主体信用、票据剩余天数以及市场供需等因素动态调整并自动生成。



          4.5责任限制



          【不可抗力及第三方原因】

          企业间票据撮合平台依照法律规定履行基础保障义务，但对于下述原因导致的合同履行障碍、履行瑕疵、履行延后或履行内容变更等情形，企业间票据撮合平台并不承担相应的违约责任：

          （一）因自然灾害、罢工、暴乱、战争、政府行为、司法行政命令等不可抗力因素；

          （二）因电力供应故障、通讯网络故障等公共服务因素或第三人因素；

          （三）在企业间票据撮合平台已尽善意管理的情况下，因常规或紧急的设备与系统维护、设备与系统故障、网络信息与数据安全等因素。



          【海量信息】

          企业间票据撮合平台仅向会员提供信息撮合服务，会员了解商票圈平台上的信息系用户自行发布，且可能存在风险和瑕疵。

          企业间票据撮合平台无法逐一审查会员双方的主体资质、所涉票据或服务的信息，以及合法性、真实性、准确性，对此会员应谨慎判断。



          五、 用户信息的保护及授权



          5.1用户信息的保护



          企业间票据撮合平台非常重视用户信息（即能够独立或与其他信息结合后识别用户身份的信息）的保护，在会员使用企业间票据撮合平台提供的服务时，会员同意企业间票据撮合平台按照在企业间票据撮合平台台上公布的隐私权政策收集、存储、使用、披露和保护会员的企业信息。商票圈希望通过隐私权政策向会员清楚地介绍商票圈对会员信息的处理方式，因此商票圈建议会员完整地阅读隐私权政策，以帮助会员更好地保护隐私权。



          5.2非用户信息的保证与授权



          【信息的发布】

          会员声明并保证，会员对会员所发布的信息拥有相应、合法的权利。否则，企业间票据撮合平台可对会员发布的信息依法或依本协议进行删除或屏蔽。



          【禁止性信息】

          会员应当确保会员所发布的信息不包含以下内容：

          （一）违反国家法律法规禁止性规定的；

          （二）政治宣传、封建迷信、淫秽、色情、赌博、暴力、恐怖或者教唆犯罪的；

          （三）欺诈、虚假、不准确或存在误导性的；

          （四）侵犯他人知识产权或涉及第三方商业秘密及其他专有权利的；

          （五）侮辱、诽谤、恐吓、涉及他人隐私等侵害他人合法权益的；

          （六）存在可能破坏、篡改、删除、影响商票圈平台任何系统正常运行或未经授权秘密获取企业间票据撮合平台平台及其他用户的数据、个人资料的病毒、木马、爬虫等恶意软件、程序代码的；

          （七）其他违背社会公共利益或公共道德或依据相关商票圈平台协议、规则的规定不适合在企业间票据撮合平台台上发布的。



          六、 用户的违约及处理



          6.1 违约认定



          发生如下情形之一的，视为会员违约：

          （一）使用企业间票据撮合平台平台服务时违反有关法律法规规定的；

          （二）违反本协议或本协议补充协议（即本协议第2.2条）约定的。

          为适应电子商务发展和满足海量用户对高效优质服务的需求，会员理解并同意，企业间票据撮合平台可在企业间票据撮合平台平台规则中约定违约认定的程序和标准。如：商票圈可依据会员的用户数据与海量用户数据的关系来认定会员是否构成违约；会员有义务对会员的数据异常现象进行充分举证和合理解释，否则将被认定为违约。



          6.2 违约处理措施



          【信息处理】

          会员在企业间票据撮合平台平台上发布的信息构成违约的，企业间票据撮合平台可根据相应规则立即对相应信息进行删除、屏蔽处理或对会员发布的需求进行撤回、监管。



          【行为限制】

          会员在企业间票据撮合平台平台上实施的行为，或虽未在企业间票据撮合平台平台上实施但对商票圈平台及其用户产生影响的行为构成违约的，企业间票据撮合平台可依据相应规则中止向会员提供部分或全部服务、划扣保证金等处理措施。如会员的行为构成根本违约的，商票圈可查封会员的账户，终止向会员提供服务。



          【处理结果公示】

          企业间票据撮合平台可将对会员上述违约行为处理措施信息以及其他经国家行政或司法机关生效法律文书确认的违法信息在企业间票据撮合平台平台上予以公示。



          6.3赔偿责任



          如会员的行为使企业间票据撮合平台及/或其关联公司遭受损失（包括自身的直接经济损失、商誉损失及对外支付的赔偿金、和解款、律师费、诉讼费等间接经济损失），会员应赔偿企业间票据撮合平台及/或其关联公司的上述全部损失。

          如会员的行为使企业间票据撮合平台及/或其关联公司遭受第三人主张权利，企业间票据撮合平台及/或其关联公司可在对第三人承担金钱给付等义务后就全部损失向会员追偿。

          如因会员的行为使得第三人遭受损失、企业间票据撮合平台及/或其关联公司出于社会公共利益保护目的，会员同意委托商票圈使用自有资金代会员支付上述款项，会员应当返还该部分费用并赔偿因此造成商票圈的全部损失。



          6.4特别约定



          【商业贿赂】

          如会员向企业间票据撮合平台及/或其关联公司的雇员或顾问等提供实物、现金、现金等价物、劳务、旅游等价值明显超出正常商务洽谈范畴的利益，则可视为会员存在商业贿赂行为。发生上述情形的，企业间票据撮合平台可立即终止与会员的所有合作并向会员收取违约金及/或赔偿金，该等金额以商票圈因会员的贿赂行为而遭受的经济损失和商誉损失作为计算依据。



          【关联处理】

          如会员因严重违约导致企业间票据撮合平台终止本协议时，出于维护平台秩序及保护其他会员权益的目的，商票圈及/或其关联公司可对与会员在其他协议项下的合作采取中止甚或终止协议的措施，并以本协议第八条约定的方式通知会员。



          七、 协议的变更



          企业间票据撮合平台可根据国家法律法规变化及维护秩序的需要，不时修改本协议、补充协议，变更后的协议、补充协议（下称“变更事项”）将通过法定程序并以本协议第八条约定的方式通知会员。

          如会员不同意变更事项，会员有权于变更事项确定的生效日前联系商票圈反馈意见。如反馈意见得以采纳，企业间票据撮合平台酌情调整变更事项。

          如会员对已生效的变更事项仍不同意的，会员应当于变更事项确定的生效之日起停止使用企业间票据撮合平台平台服务，变更事项对会员不产生效力；如会员在变更事项生效后仍继续使用商票圈平台服务，则视为会员同意已生效的变更事项。



          八、 通知



          8.1有效联系方式



          会员在注册成为企业间票据撮合平台平台用户，并接受企业间票据撮合平台平台服务时，会员应该向企业间票据撮合平台提供真实有效的联系方式（包括会员的电子邮件地址、联系电话、联系地址等），对于联系方式发生变更的，会员有义务及时更新有关信息，并保持可被联系的状态。

          企业间票据撮合平台将向会员的上述联系方式的其中之一或其中若干向会员送达各类通知，而此类通知的内容可能对会员的权利义务产生重大的有利或不利影响，请会员务必及时关注。



          8.2 通知的送达



          企业间票据撮合平台通过上述联系方式向会员发出通知，其中以电子的方式发出的书面通知，包括但不限于在企业间票据撮合平台公告，向会员提供的联系电话发送手机短信，向会员提供的电子邮件地址发送电子邮件，在发送成功后即视为送达；以纸质载体发出的书面通知，按照提供联系地址交邮后的第五个自然日即视为送达。

          对于在企业间票据撮合平台上因票据及票据收益权转、受让行为引起的任何纠纷，会员同意司法机关（包括但不限于人民法院）可以通过手机短信、电子邮件等现代通讯方式或邮寄方式向会员送达法律文书（包括但不限于诉讼文书）。会员指定接收法律文书的手机号码、电子邮箱等联系方式为会员在商票圈平台注册、更新时提供的手机号码、电子邮箱联系方式，司法机关向上述联系方式发出法律文书即视为送达。会员指定的邮寄地址为会员的法定联系地址或会员提供的有效联系地址。

          会员同意司法机关可采取以上一种或多种送达方式向会员达法律文书，司法机关采取多种方式向会员送达法律文书，送达时间以上述送达方式中最先送达的为准。

          会员同意上述送达方式适用于各个司法程序阶段。如进入诉讼程序的，包括但不限于一审、二审、再审、执行以及督促程序等。

          会员应当保证所提供的联系方式是准确、有效的，并进行实时更新。如果因提供的联系方式不确切，或不及时告知变更后的联系方式，使法律文书无法送达或未及时送达，由会员自行承担由此可能产生的法律后果。



          九、 协议的终止



          9.1 终止的情形



          【用户发起的终止】

          会员有权通过以下任一方式终止本协议：

          （一）变更事项生效前会员停止使用并明示不愿接受变更事项的；

          （二）会员明示不愿继续使用商票圈平台服务，且符合企业间票据撮合平台网终止条件的。



          【企业间票据撮合平台发起的终止】

          出现以下情况时，企业间票据撮合平台可以本协议第八条的所列的方式通知会员终止本协议：

          （一）会员违反本协议约定，商票圈依据违约条款终止本协议的；

          （二）会员盗用他人账户、扰乱市场秩序、采取不正当手段谋利等行为，企业间票据撮合平台平台规则对会员的账户予以查封的；

          （三）除上述情形外，因会员多次违反商票圈平台规则相关规定且情节严重，企业间票据撮合平台规则对会员的账户予以查封的；

          （四）会员的账户被企业间票据撮合平台依据本协议回收的；

          （五）其它应当终止服务的情况。



          9.2 协议终止后的处理



          【用户信息披露】

          本协议终止后，除法律有明确规定外，企业间票据撮合平台无义务向会员或会员指定的第三方披露会员账户中的任何信息。



          【企业间票据撮合平台权利】

          本协议终止后，企业间票据撮合平台仍享有下列权利：

          （一）继续保存会员留存于商票圈平台的本协议第五条所列的各类信息；

          （二）对于会员过往的违约行为，企业间票据撮合平台仍可依据本协议向会员追究违约责任。



          十、 法律适用、管辖与其他



          【法律适用】

          本协议之订立、生效、解释、修订、补充、终止、执行与争议解决均适用中华人民共和国大陆地区法律；如法律无相关规定的，参照商业惯例及/或行业惯例。



          【管辖】

          会员因使用企业间票据撮合平台服务所产生及与企业间票据撮合平台服务有关的争议，由企业间票据撮合平台与会员协商解决。协商不成时，任何一方均可向被告所在地或商票圈所在地的人民法院提起诉讼。



          【可分性】

          本协议任一条款被视为废止、无效或不可执行，该条应视为可分的且并不影响本协议其余条款的有效性及可执行性。



        </el-form>
        <span slot="footer" class="dialog-footer">
    <el-button @click="checked = false;dialogFormVisible = false">取消</el-button>
    <el-button type="primary"  @click="dialogFormVisible = false;checked=true">确认</el-button>
  </span>
      </el-dialog>
    </div>

  </div>
</template>

<script>
  export default {
    name: "Register",
    data() {
      return {
        checked: false,
        rules: {
          account: [{required: true, message: '请输入电话号码', trigger: 'blur'}],
          auth: [{required: true, message: '请输入验证码', trigger: 'blur'}],
          password: [{required: true, message: '请输入密码字母加数字', trigger: 'blur'}],
        },
        dialogTableVisible: false,
        dialogFormVisible: false,
        formLabelWidth: '120px',
        form:{
          // eename:'',
        },
        userForm: {
          account:'',
          auth:'',
          password:''
        }
      }
    },
    methods: {
      getting() {
        let that=this
       // event.preventDefault();
        if(that.userForm.account==''){
          return this.$message({message: '请填写手机号码 ',type: 'error',showClose: true})
        }
        this.axios.post('http://localhost:8081/gettel',
          this.userForm
        )
          .then(res => {
            if (res.data == '002') {
              this.$message({message: '该用户已被注册', type: 'warn'});
            }
            if (res.data == '000') {
              this.$message({message: '验证码已发送，请注意查收', type: 'success'});
            }
          })
          .catch(error => {
            console.log(error);
          });
      },
      register(formName) {
        let that = this

        var re = /^1\d{10}$/
        //账号必须1开头11位
        //字母、数字、下划线组成，字母开头，4-16位
        // 8-16位字符；数字、字母、特殊字符（除空格），起码其中两种组合 这个密码验证的正则表达式
        var ps =  /^(?![\d]+$)(?![a-zA-Z]+$)(?![^\da-zA-Z]+$).{8,16}$/;

        if(that.checked===false){
          return  this.$message({message: '请遵守协议', type: 'error'})
        }else if(re.test(that.userForm.account)&&ps.test(that.userForm.password)){

          this.$refs[formName].validate((valid) => {
            if (valid) {
              that.$store.dispatch('register', that.userForm).then(() => {
                that.$message({message: '注册成功 快去完善信息吧',type: 'success',showClose: true});
                that.$router.push({ path: '/basic' })
              }).catch((error) => {
                if(error !== 'error'){
                  that.$message({message: error,type: 'error',showClose: true});
                }
              })

            } else {
              return false;
            }
          });


        }else{
          this.$message({message: '请填写正确的手机号码和密码 ',type: 'error',showClose: true})
        }


      }
    }

  }
</script>

<style scoped>
  .beijing{
    background: url("../assets/img/timg.jpg");
  }
#Register{
  width: 300px;
  height: 250px;
  margin: 50px auto;
  /*padding-top: 150px;*/
  /*opacity: 0.5;*/

}
  #caiji{
    position: absolute;
    width: 380px;
    height:380px;
    /*border: 1px solid #ffffff;*/
    margin-left: 450px;
    margin-top: 80px;
    /*background-color: white;*/
    /*opacity: 0.5;*/
    background: rgba(0, 0, 0, 0.35);
    border-radius: 25px;
  }
</style>
